Repository: wp-plugins/typofr
Catalog: languages/typofr-*.po
Languages: fr_fr

source: %s : Settings
fr_fr: %s : Paramètres

source: Contents fixing
fr_fr: Correction des contenus

source: Fix to apply
fr_fr: Correction à appliquer

source: Miscellaneous Policies
fr_fr: Paramètres généraux

source: Deactivation
fr_fr: Désactivation

source: Should deactivating the plugin remove all of the plugin's data and settings ?
fr_fr: Souhaitez-vous que tous les paramètres soient supprimés lors de la désactivation du plugin ?

source: No, preserve the data for future use.
fr_fr: Non, conservez les paramètres pour une utilisation future.

source: Yes, delete the damn data.
fr_fr: Oui, supprimez-les tous.

source: Debugging
fr_fr: Debogage

source: Should the plugin log information in the browser console ?
fr_fr: Souhaitez-vous que le plugin loggue des informations dans la console du navigateur ?

source: No.
fr_fr: Non.

source: Yes, please.
fr_fr: Oui, merci.

source: Title fixing
fr_fr: Correction des titres

source: Should the plugin fix all the posts' titles ?
fr_fr: Souhaitez-vous que le plugin corrige tous les titres

source: No, preserve the titles as they are.
fr_fr: Non, gardez les titres comme ils sont.

source: Yes, please, fix them for me.
fr_fr: Oui, merci de les corriger pour moi.

source: Content fixing
fr_fr: Correction des contenus

source: Should the plugin fix all the posts' contents ?
fr_fr: Souhaitez-vous que le plugin corrige tous les contenus ?

source: No, preserve the contents as they are.
fr_fr: Non, gardez les contenus comme ils sont.

source: Excerpt fixing
fr_fr: Correction des extraits

source: Should the plugin fix all the posts' excerpts ?
fr_fr: Souhaitez-vous que le plugin corrige tous les extraits ?

source: No, preserve the excerpts as they are.
fr_fr: Non, gardez les extraits comme ils sont.

source: Ellipsis
fr_fr: Ellipse

source: Should the plugin replace all occurences of three dots by an ellipsis ?
fr_fr: Souhaitez-vous que le plugin remplace toutes occurences de trois points par une ellipse ?

source: No, do not replace.
fr_fr: Non, ne pas remplacer.

source: Should the plugin detect the letter x between number and replace it by the real math symbol ?
fr_fr: Souhaitez-vous que le plugin détecte la lettre x entre des nombres et la remplace par le véritable symbole mathématique ?

source: Dashes
fr_fr: Tiret

source: Should the plugin replace '-' by ndash '–' (dates ranges) or double-dash -- by a mdash — ?
fr_fr: Souhaitez-vous que le plugin remplace le tiret simple par un tiret cadratin ou demi-cadratin quand cela est nécessaire (plages de dates, inclusions...) ?

source: French quotes
fr_fr: Guillemets à la française

source: Should the plugin convert dumb quotes " " to smart French style quotation marks « » and use a no break space ?
fr_fr: Souhaitez-vous que le plugin remplace les guillemets " " par la notation française « » en utilisant les espaces incésables nécéssaires ?

source: French No Break Space
fr_fr: Espaces insécables

source: Should the plugin replace some classic spaces by non breaking spaces following the French typographic code ?
fr_fr: Souhaitez-vous que le plugin remplace certains espaces classiques par des espaces insécables, en appliquant les règles de typographie à la française ?

source: CurlyQuote
fr_fr: Apostrophe

source: Should the plugin replace straight quotes ' by curly one's ’ ?
fr_fr: Souhaitez-vous que le plugin remplace l'apostophe droite par une apostrophe typographique là où cela sera nécessaire ?

source: Automatic hyphenation
fr_fr: Trait d'union

source: Should the plugin enable word hyphenation ?
fr_fr: Souhaitez-vous que le plugin améliore la détermination de l'endroit où les mots seront coupées en deux (avec un tiret en fin de ligne indiquant l'unité du mot) ?

source: Should the plugin replace (r), (c) and (TM) by the right symbols ?
fr_fr: Souhaitez-vous que le plugin remplace (r), (c), et (TM) par les symboles appropriés ?

source: Settings
fr_fr: Paramètres

source: An explanation of this section...
fr_fr: Une explication de cette section&#8230;

source: Default:
fr_fr: Defaut:

source: must be >= '%s',
fr_fr: doit être >= '%s',

source: so we used the default value instead.
fr_fr: donc nous allons plutôt utiliser la valeur par défaut.

source: must be an integer,
fr_fr: doit être un entier.

source: https://github.com/borisschapira/typofr
fr_fr: un plugin pour l'implémentation des règles de typographie à la française, utilisant la librairie JoliTypo

source: a plugin for french typography management, powered by JoliTypo
fr_fr: un plugin pour l'implémentation des règles de typographie à la française, utilisant la librairie JoliTypo.
